5.2.6 함수 적용과 매핑

In [55]:
import pandas as pd
import numpy as np

In [4]:
frame = pd.DataFrame(np.random.randn(4,3), columns = list('bde'),
                    index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

In [5]:
frame

               b         d         e
Utah    0.176932 -1.607454 -2.264588
Ohio    1.904019  0.310023  0.984181
Texas   0.944554 -0.199375  1.290708
Oregon -0.069522 -1.830638 -1.431730

In [6]:
np.abs(frame)    # abs() = 절대값을 나타내는 함수

               b         d         e
Utah    0.176932  1.607454  2.264588
Ohio    1.904019  0.310023  0.984181
Texas   0.944554  0.199375  1.290708
Oregon  0.069522  1.830638  1.431730

In [7]:
f = lambda x: x.max() - x.min()

In [8]:
frame.apply(f)    # apply() 메서드를 이용해 1차원 배열에 함수를 적용한다.

b    1.973541
d    2.140660
e    3.555295
dtype: float64

In [9]:
frame.apply(f,axis = 'columns')

Utah      2.441520
Ohio      1.593996
Texas     1.490083
Oregon    1.761115
dtype: float64

In [10]:
def f(x):
    return pd.Series([x.min(),x.max()], index = ['min','max'])

In [11]:
frame.apply(f)

            b         d         e
min -0.069522 -1.830638 -2.264588
max  1.904019  0.310023  1.290708

In [12]:
format = lambda x: '%.2f'% x  # %.2f = 소수 2째 자리, 전체 자리는 자동으로

In [14]:
frame

               b         d         e
Utah    0.176932 -1.607454 -2.264588
Ohio    1.904019  0.310023  0.984181
Texas   0.944554 -0.199375  1.290708
Oregon -0.069522 -1.830638 -1.431730

In [15]:
frame.applymap(format)

            b      d      e
Utah     0.18  -1.61  -2.26
Ohio     1.90   0.31   0.98
Texas    0.94  -0.20   1.29
Oregon  -0.07  -1.83  -1.43

In [16]:
frame['e'].map(format)

Utah      -2.26
Ohio       0.98
Texas      1.29
Oregon    -1.43
Name: e, dtype: object

5.2.7 정렬과 순위

In [17]:
obj = pd.Series(range(4), index = ['d','a','b','c'])

In [19]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [20]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                    index = ['three', 'one'],
                    columns = ['d','a','b','c'])

In [21]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [27]:
frame.sort_index(axis= 1)    # 컬럼 인덱스를 정렬

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [24]:
frame.sort_index(axis=1, ascending=False) # 컬럼 인덱스를 내림차순으로 정렬해라

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [29]:
obj = pd.Series([4,7,-3,2])

In [30]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [31]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0,1,0,1]})

In [32]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [33]:
frame.sort_values(by = 'b')  # by를 이용해서 정렬할 값 선택

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [34]:
frame.sort_values(by = ['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [35]:
obj = pd.Series([7,-5,7,4,2,0,4])

In [47]:
obj2 = pd.Series([7,-5,7,4,2,0,4,7])

In [38]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [36]:
obj.rank() # 순위를 매김 동점일시 평균값

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [37]:
obj.rank(method = 'first')  # 동점일 시 먼저 나온 순으로 순위 적용

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [39]:
obj.rank(ascending = False, method = 'max') # 내림차순으로 순위 적용 중복시 제일 큰 순위로 적용

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [48]:
obj2.rank(ascending = False, method = 'max')

0    3.0
1    8.0
2    3.0
3    5.0
4    6.0
5    7.0
6    5.0
7    3.0
dtype: float64

In [40]:
frame = pd.DataFrame({'b':[4.3,7,-3,2], 'a':[0,1,0,1],'c':[-2,5,8,-2.5]})

In [41]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [43]:
frame.rank(axis = 'columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

5.2.8 중복 색인

In [49]:
obj = pd.Series(range(5), index = ['a','a','b','b','c'])

In [50]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [51]:
obj.index.is_unique

False

In [52]:
obj['a']

a    0
a    1
dtype: int64

In [53]:
obj['c']

4

In [57]:
df = pd.DataFrame(np.random.randn(4,3), index = ['a','a','b','b'])

In [58]:
df

          0         1         2
a  0.845997 -0.455281  0.233386
a  0.907009 -0.551004  0.160956
b -1.180233  0.785433  0.625852
b -0.763246  0.604940  1.416070

# 5.3 기술 통계 계산과 요약

In [60]:
df = pd.DataFrame([[1.4,np.nan],[7.1, -4.5],[np.nan, np.nan],[0.75, -1.3]],
                 index = ['a','b','c','d'],
                 columns = ['one','two'])

In [61]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [63]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [64]:
df.sum(axis = 'columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [67]:
df.mean(axis = 'columns', skipna = False)  # mean() = 평균값 구하는 메서드, skipna = nan값 제외 결정 옵션

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [68]:
df.idxmax()   # 최댓값, 최솟값

one    b
two    d
dtype: object

In [69]:
df.cumsum()  # 누적합

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [70]:
df.describe() # 여러개의 통계 결과를 만들어냄

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [78]:
obj = pd.Series(['a','b','b','c'] *4)

In [79]:
obj.describe()

count     16
unique     3
top        b
freq       8
dtype: object

5.3.1 상관관계와 공분산

In [81]:
import pandas_datareader.data as web

D:\Download\anaconda3\lib\site-packages\pandas_datareader\compat\__init__.py:7: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  from pandas.util.testing import assert_frame_equal

In [86]:
all_data = {ticker: web.get_data_yahoo(ticker)
           for ticker in ['AAPL','IBM','MSFT','GOOG']}
price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker:data['Volume']
                      for ticker,data in all_data.items()})

In [88]:
returns =  price.pct_change()

In [89]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2020-07-14  0.016548  0.011745  0.006181  0.006114
2020-07-15  0.006877  0.019901 -0.001488 -0.004564
2020-07-16 -0.012305  0.008211 -0.019804  0.002880
2020-07-17 -0.002020  0.008870 -0.005100 -0.001614
2020-07-20  0.021074  0.010071  0.042981  0.033103

In [90]:
returns['MSFT'].corr(returns['IBM'])

0.5932757131783176

In [91]:
returns['MSFT'].cov(returns['IBM'])

0.0001661323877096239

In [92]:
returns.MSFT.corr(returns.IBM)

0.5932757131783176

In [93]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.527319  0.715187  0.669079
IBM   0.527319  1.000000  0.593276  0.542109
MSFT  0.715187  0.593276  1.000000  0.782024
GOOG  0.669079  0.542109  0.782024  1.000000

In [94]:
returns.corrwith(returns.IBM)

AAPL    0.527319
IBM     1.000000
MSFT    0.593276
GOOG    0.542109
dtype: float64

In [95]:
returns.corrwith(volume)

AAPL   -0.132947
IBM    -0.105303
MSFT   -0.061835
GOOG   -0.147565
dtype: float64

5.3.2 유일값, 값 세기, 멤버십

In [96]:
obj = pd.Series(['c','a','d','a','a','b','b','c','c'])

In [97]:
uniques = obj.unique()

In [98]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [99]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [100]:
pd.value_counts(obj.values,sort = False)

d    1
b    2
c    3
a    3
dtype: int64

In [101]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [102]:
mask = obj.isin(['b','c'])

In [103]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [104]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [105]:
to_match = pd.Series(['c','a','b','b','c','a'])

In [106]:
unique_vals = pd.Series(['c','b','a'])

In [107]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [108]:
data = pd.DataFrame({'Qu1': [1,3,4,3,4],
                    'Qu2':[2,3,1,2,3,],
                    'Qu3': [1,5,2,4,4]})

In [109]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [111]:
result = data.apply(pd.value_counts).fillna(0)

In [112]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0